src/vcp/README.org
g# to create a markdown file with a table of contents:
# - M-x org-md-export-to-markdown
# - make fix-readme-markdown

#+TITLE: Overview of the Verifiable Credentials Platform (VCP) abstraction, implementation, and test framework

#+OPTIONS: broken-links:t
#+OPTIONS: toc:t

* Introduction

This directory contains work towards defining and implementing an abstraction to decouple verifiable
credential formats and presentation/proof requests on one hand from underlying zero-knowledge proof (ZKP)
libraries on the other.  Test code related to this work, including the test framework described
below, is under the [[../../tests/vcp/test_framework/][tests/vcp/test_framework]] directory.

We have instantiated our abstraction with two underlying ZKP libraries
- the ZKP library that is part of the [[https://github.com/hyperledger/anoncreds-v2-rs][AnonCreds v2]] repo
  - referred to as AC2C in order to distinguish it from the broader project
- the ZKP library that is part of the [[https://github.com/docknetwork/crypto/][DockNetwork crypto]] repo
  - referred to as DNC

The information below is intended to help the reader approach this code after gaining some
familiarity with the work by reviewing the [[https://www.dropbox.com/preview/Presentations/IIW%20Oct%202024%20-%20VC%20and%20ZPK%20abstraction.pdf][slides]] that we presented at
[[https://internetidentityworkshop.com][IIW]] in October, 2024.

This work is by [[https://github.com/haroldcarr][Harold Carr]] and [[https://github.com/mark-moir][Mark Moir]] of Oracle Labs, and [[https://github.com/rybla][Henry Blanchette]]
of the University of Maryland at College Park, during his Summer 2024 internship at Oracle Labs.

* Caveats

This is research work in progress aimed at exploring and demonstrating the benefits and feasibility
of establishing an abstraction between credential formats and cryptography/ZKP libraries.  This work
should in no way be considered for use in production or for any purpose other than engaging in such
exploration.  In particular,

- This Rust work has been contributed by three different developers with different levels of
  experience and expertise in the relevant languages and knowledge about the domain and details of
  the internal Haskell prototype on which it is based.
- Some code was written by an intern who is experienced in Rust, and some was written by his Oracle
  Labs mentors at different times during their Rust learning process.  Therefore, different styles,
  tastes, and levels of expertise are evident in different parts of the code.  While we have made
  progress towards more consistent styles throughout, this is not complete.
- There are quite a few TODOs, potentially including some that would undermine security if left
  undone before this code were used in a practical application.
- While we hope to eventually contribute to [[https://github.com/hyperledger/anoncreds-v2-rs][Hyperledger AnonCreds, v2]] based on this work, we are not
  raising a Pull Request at this stage. Rather, we have made this work public in order to facilitate
  feedback and engagement towards something that we can offer as a contribution.

* User abstraction

From an application/user perspective, our abstraction is defined by the
~PlatformAPI~ type in [[./api.rs][./api.rs]]. There are several possible ways to access it:

- By using the ~implement_platform_api_using~ function in [[./api_utils.rs][./api_utils.rs]] and providing an instance of
  ~CryptoInterface~, such as ~CRYPTO_INTERFACE_AC2C~ (defined in [[./zkp_backends/ac2c/crypto_interface.rs][./zkp_backends/ac2c/crypto_interface.rs]]) and calling
  its methods directly.  See [[connecting-zkp-libary-to-platform]] for more details.
- By accessing the functionality via a Swagger/OpenAPI interface. We have built an HTTP
  server serving such an interface built automatically from our Haskell prototype. However,
  this is internal work, and is not up-to-date.  Future work includes implementing an HTTP server in Rust.
- Via our test framework, described below.  We recommend this approach as the easiest way to get
  started gaining some familiarity with our interface because, as detailed below, the test framework
  handles a lot of common setup tasks and manages data for all roles, which a user would otherwise
  have to do explicitly.  In the sections below, we first describe the test framework and how tests can be
  added without any programming. We then explain how those tests connect to the API and to the
  underlying implementation.

We note that there are a number of additional tests, beyond those that use the test framework.  These
are less general, more historic, less well organised, etc.  We recommend focusing on the JSON tests
that are run by the test framework.

* Running tests

We have added a number of tests, many of which are expressed in JSON.  More such tests can be added
simply by adding JSON files, with no programming required.  The test framework that enables this is
described in the next section.

The [[../../Makefile][../../Makefile]] supports a number of =make= targets for running/skipping tests according to various
criteria.  The two most important are =make test= and =make test-all=.  The former skips tests that are
overridden to fail (see Section [[sec:overriding]]), so that unexpected failures are not masked by
those tests.  The latter runs these tests as well, so that the failures can be seen.

* The test framework

The goal of our test framework is to enable easily specifying a sequence of actions that exercise
the API and test its behavior in various scenarios.  Tests are expressed in JSON and automatically
run by our framework.  A new JSON test can be added to
[[../../tests/data/JSON/TestSequences/LicenseSubscription][../../tests/data/JSON/TestSequences/LicenseSubscription]], where there are a number of examples
already. Tests are generated at compile time from these JSON files. Therefore, after adding a new
test it is necessary to ensure recompilation, using these steps, for example:
#+begin_example
cd <root of this repo>
touch tests/data/JSON/TestSequences/LicenseSubscription/*.json  # It is *not* sufficient to touch only the new test
make test
#+end_example

