src/vcp/README.md


<a id="org05e5963"></a>

## JSON test file naming and contents

JSON test files contain the following fields:

-   `descr` - a short description of the test
-   `provenance` - information to enable finding where the test came from, how it was generated, etc.
-   `comment` (optional) - a comment about the test
-   `testseq` - an array of `TestStep`, see below

The filename for the JSON test must be `json_test_nnn_<str>` for some three-digit `nnn`, where `str`
must be identical to the contents of its `descr` field.

Including `expected_to_fail` in the test's `descr` field (and therefore in its filename) "reverses" the
test, so that if the test (at the level of the test framework) <span class="underline">succeeds</span>, then the test is reported
as a failure, and vice versa.  (Note that we sometimes include `negative_test` in a test name.  This
has no bearing on whether and how the test is run: it is merely a <span class="underline">convention</span> to indicate that this
test is using the API differently than intended.)

In addition to running all tests using `make test`, an individual test can be run using its `descr` field.  For example,
to run only the test described in the next section:

    cd <root of this repo>
    cargo test example_single_issuer_and_credential_in_accum_no_update


<a id="org84f2470"></a>

## Overview of test framework

The test framework maintains state representing all data of all roles (Issuers, Holders,
Authorities, and Revocation Managers. It is assumed that there is a single, unnamed verifier). (This
is represented in the `TestState` data type in
[../../tests/vcp/test_framework/types.rs](../../tests/vcp/test_framework/types.rs)).

Each `TestStep` updates the state and/or checks whether some condition holds in that state.  The
implementation of each `TestStep` invokes one or more methods in the API as noted in the description
for each `TestStep` below. For convenience and ease of use, some `TestSteps` model multiple real world
events. For example, the `Sign` step models an Issuer signing a credential, sending the signature to
the requesting Holder, the Holder receiving the signature and storing it locally.

We make the simplifying assumption that each Holder can possess at most one credential signed by
each Issuer. This enables referring to credentials by the label of the Issuer that signed them.


<a id="orgb3a606d"></a>

## An example

Before describing each `TestStep` in detail, we first walk through the example in
[../../tests/data/JSON/TestSequences/LicenseSubscription/json_test_028_example_single_issuer_and_credential_in_accum_no_update.json](../../tests/data/JSON/TestSequences/LicenseSubscription/json_test_028_example_single_issuer_and_credential_in_accum_no_update.json)
(from [our IIW presentation](https://www.dropbox.com/preview/Presentations/IIW%20Oct%202024%20-%20VC%20and%20ZPK%20abstraction.pdf)).

Each `TestStep` in the JSON file has a `tag` field that identifies the kind of step, and a `contents`
field that provides its arguments.

The first step in our example is a `CreateIssuer` step, which establishes an Issuer (for signing credentials)
identified by the label given in the first argument, for a schema defined in the second.  In the example, we
create an Issuer with label `DMV` and a schema with five attributes, the last of which is an
accumulator member (`CTAccumulatorMember`), meaning that it is a field that will be used for set
membership (e.g., for revocation).

The second (`CreateAccumulators)` step creates and initializes an accumulator for each
`CTAccumulatorMember` field in the schema (only one in our example). `CreateAccumulators` is an
example of a utility function that uses, but is not directly supported by `PlatformAPI`; see comments
in [../../tests/vcp/test_framework/utility_functions.rs](../../tests/vcp/test_framework/utility_functions.rs).

The third (`SignCredential`) step, Issuer `DMV`, signs a credential for `Holder1`, specifying values for each of
the five attributes indicated by the schema specified when the `DMV` Issuer was created.

The fourth step (`AccumulatorAddRemove`) adds a "batch" of accumulator members (consisting of only
`Holder1`'s accumulator member in this case) to the accumulator associated with attribute 4 for `DMV`,
and also removes a "batch" of accumulator members (which is empty in this case).  Furthermore, for
each accumulator member added to the accumulator, a new `AccumulatorMembershipWitness` is created and associated with the
specified Holder's credential for the specified Issuer (if the specified Issuer has not been
created, or if no credential has been signed by that Issuer for a specified Holder, then an error
will be generated).  At this stage, because one batch has been applied to the accumulator since it
was created, the new witness is valid for `BatchSeqNo` `1`, which will be important when we
come to request proving membership in the accumulator (see the `InAccum` step below).

The fifth step (`Reveal`) says that `Holder1` should reveal attributes `0` and `3` from its credential signed
by `DMV`. Note that this is simply adding to the requirements that will be used when
creating a proof later.

Similarly, the sixth step (`InAccum`) says that `Holder1` should prove that its accumulator member is a
member of the accumulator associated with attribute `4` at `BatchSeqNo` `1`.

Finally, the seventh step (`CreateAndVerifyProof`) attempts to create a proof satisfying all of the
requirements established for `Holder1` so far in the test, and to then verify that proof. The
`TestExpectation` is specified to be `BothSucceedNoWarning`. Therefore, the test will fail if either
creating or verifying the proof fails or issues a warning.  Apart from checking that a proof can be
created and verified, the `CreateAndVerifyProof` step verifies that the revealed attributes are the same
as the one signed in the relevant credential, and (in examples involving decryption) that the
decrypted values match the original signed values.


<a id="org299b089"></a>

## TestSteps


<a id="orgcb83e6c"></a>

### CreateIssuer


<a id="org835f003"></a>

#### Effects

-   Creates new Issuer with associated `SignerData`


<a id="org1680fdc"></a>

#### Arguments

-   `IssuerLabel`: label to identify new Issuer
-   `[ ClaimType ]`: schema for new Issuer


<a id="org42f1ff3"></a>

#### API method(s) invoked

-   `create_signer_data`


<a id="orgefb0eaf"></a>

### CreateAccumulators


<a id="org0626e5d"></a>

#### Effects

-   Creates `AccumulatorData` for each `CTAccumulatorMember` attribute in specified Issuer's schema


<a id="orga0f30c8"></a>

#### Arguments

-   `IssuerLabel`


<a id="org51d4785"></a>

#### API method(s) invoked

-   `create_accumulator_data` (once for each created accumulator)


<a id="orgad6e16b"></a>

### SignCredential


<a id="org704c81c"></a>

#### Effects

-   Creates new credential (`SignatureAndRelatedData`) signed by specified Issuer with specified
    `DataValue` s for specified `Holder` ("related data" includes `DataValue` s signed and an empty map
    that will be used to store `AccumulatorMembershipWitness` es when they are created by an
    `AccumulatorAddRemove` step).  If the fourth argument is provided, the value of the identified
    attribute is replaced by the maximum value for which a range proof can be supported by the
    underlying ZKP library, plus the identified offset.


<a id="org09485a6"></a>

#### Arguments

-   `IssuerLabel`: label identifying previously created Issuer
-   `HolderLabel`: label identifying Holder
-   `[ DataValue ]`: list of values to be signed, one for each attribute of Issuer's schema
-   `Option<ReplaceValueWithMaximumPlus>`: if provided, identifies an attribute index
    `attrIdxToReplaceWithMaxSupported` and an offset `plusOffset`.  Argument used only for
    testing that the underlying ZKP library's `get_range_proof_max_value` API function returns an
    accurate value.
