src/vcp/README.org
**** Effects
  - Add some ~DataValue~ s to and remove some ~DataValue~ s from accumulator associated with specified
    Issuer and attribute.
  - Each ~DataValue~ added generates an ~AccumulatorMembershipWitness~ for the new accumulator value,
    which is stored in the ~SignatureAndRelatedData~ associated with specified Holder and the
    ~AccumlatorBatchSeqNo~ of this batch of additions and removals.  This information can be used by
    subsequent ~UpdateAccumulatorWitness~ and ~CreateAndVerify~ steps.
  - Stores "update information" associated with updating ~Accumulatormembershipwitness~ es
    from previous ~AccumulatorBatchSeqNo~ to new one,for use by subsequent ~UpdateAccumulatorWitness~ steps
**** Arguments
   - ~IssuerLabel~
   - ~CredAttrIndex~: attribute index identifying relevant accumulator associated with specified Issuer
   - ~Map HolderLabel DataValue~: ~DataValue~ s to be added to specified accumulator and Holders to
     receive respective generated witnesses
   - ~[ DataValue ]~: ~DataValue~ s to be removed from specified accumulator
**** API method(s) invoked
  - ~accumulator_add_remove~

*** UpdateAccumulatorWitness
**** Effects
  - Attempts to ensure that specified Holder has an ~AccumulatorMembershipWitness~ for accumulator
    identified by specified Issuer and attribute index.
  - This is possible only if
    - a) specified Holder already has an ~AccumulatorMembershipWitness~ for identified accumulator for
      an ~AccumulatorBatchSeqNo~ that is at most the target ~AccumulatorBatchSeqNo~, and
    - b) there have been sufficient ~AccumulatorAddRemove~ steps performed that "update information"
      has been stored to enable updating to specified ~AccumulatorBatchSeqNo~.
  - An error is generated if these conditions do not hold.
  - When successful, generates and stores ~AccumulatorMembershipWitness~ for each ~AccumlatorBatchSeqNo~
    between the largest ~AccumlatorBatchSeqNo~ less than the target ~AccumulatorBatchSeqNo~ for which
    specified Holder already has an ~AccumulatorMembershipWitness~.
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~
   - ~CredAttrIndex~
   - ~AccumulatorBatchSeqNo~: target ~AccumulatorBatchSeqNo~ to ensure specified Holder
**** Comments
  - Currently, a Holder will always have an ~AccumulatorMembershipWitness~ for every
    ~AccumlatorBatchSeqNo~ from the one at which its ~AccumulatorMembershipWitness~ was added and the
    highest ~AccumlatorBatchSeqNo~ to which it has ever updated.
  - In practice, Holders would likely
    discard ~AccumulatorMembershipWitness~ es considered "too old".  The test framework does not
    currently support such "garbage collection".
  - If it did, Holders could always regenerate discarded ~AccumulatorMembershipWitness~ es *provided*
    they retain one with ~AccumlatorBatchSeqNo~ at or before any future target.  If not, they would
    have to request a new ~AccumulatorMembershipWitness~ from the relevant Revocation Manager; the test
    framework also does not currently support this.
**** API method(s) invoked
   - ~update_accumulator_witness~, potentially multiple times as described above

*** Reveal
**** Effects
  - adds to requirements for subsequent ~CreateAndVerifyProof~ steps for specified Holder,
    requiring that it reveals attributes with specified indexes from its credential
    signed by specified Issuer
  - generates error if:
    - specified Holder or Issuer does not exist, or
    - no credential has been signed for specified Holder by specified Issuer, or
    - any of specified attribute indexes is out of range established by Issuer's schema
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~
   - ~[ CredAttrIndex ]~: list of indexes for attributes to be revealed
**** API method(s) invoked
  - none

*** InRange
**** Effects
  - adds to requirements for subsequent ~CreateAndVerifyProof~ steps for specified Holder,
    requiring that it proves that specified attribute in a credential signed by specified Issuer
    for specified Holder is within range specified by minimum and maximum values
  - note that there is no step for creating a ~RangeProvingKey~ because one is automatically
    created when an ~InRange~ step is first encountered, and the same one is used for any subsequent
    ~InRange~ requirements
  - If the sixth argument is provided, the range's upper bound is replaced by the specified offset plus
    the maximum value for which range proofs are supported by the underlying ZKP libary, as determined by
    calling its =get_range_proof_max_value= API function.
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~
   - ~CredAttrIndex~
   - ~i64~: the minimum value in the range
   - ~i64~: the maximum value in the range
   - =Option<ReplaceUpperBoundWithMaxSupportedPlusOffset>=: if provided, specifies a replacement value
     for the range's upper bound in terms of an offset from the maximum value for which range proofs
     are supported by the underlying ZKP libary.  Argument used only for testing that the
     underlying ZKP library's =get_range_proof_max_value= API function returns an accurate value.
**** Comments
   - Step does *not* generate an error if specified attribute is out of range, because we want to be
     able to test that ~CreateAndVerifyProof~ does not succeed in this case
**** API method(s) invoked
  - none

*** InAccum
**** Effects
  - adds to requirements for subsequent ~CreateAndVerifyProof~ steps for specified Holder,
    requiring that it proves that specified attribute in a credential signed by specified Issuer
    for specified Holder is in the accumulator associated with specified Issuer and CredAttrIndex,
    as of specified ~AccumulatorBatchSeqNo~
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~
   - ~CredAttrIndex~
   - ~AccumulatorBatchSeqNo~: the "batch number" for which the proof is required; enables requiring
     proof of membership in accumulator for older or newer accumulator versions
**** API method(s) invoked
  - none

*** Equality
**** Effects
  - adds to requirements for subsequent ~CreateAndVerifyProof~ steps for specified Holder,
    requiring that it proves that specified attribute in a credential signed by specified Issuer is
    equal to each attribute specified in each "other" credentials (identified by specified Issuer)
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~: identifies Issuer who signed a credential
   - ~CredAttrIndex~: identifies an attribute in that credential
   - ~[(IssuerLabel, CredAttrIndex)]~: a list of attributes in other credentials required to be equal
      to specified attribute
**** Comments
   - It would have been cleaner to specify the equivalence class of ~(Issuer,CredAttrIndex)~ pairs,
     rather than singling on of them out
   - Step does *not* generate an error if specified attributes are not equal, because we want to be
     able to test that ~CreateAndVerifyProof~ does not succeed in this case
**** API method(s) invoked
   - none

*** CreateAndVerifyProof
