src/vcp/README.org
**** Effects
  - Attempts to create and then verify a proof satisfying all requirements added previously for
    specified Holder, and checks that the outcome is consistent with specified ~CreateVerifyExpectation~.
  - An error is generated if specified Holder cannot satisfy previously added requirements because,
    for example, specified Holder does not have a credential signed by an Issuer for a previously
    added requirement, does not have an ~AccumulatorMembershipWitness~ for a required
    ~AccumlatorBatchSeqNo~, etc.
  - note that, if previous steps include ~Decrypt~ requirements for specified Holder, subsequent
    ~CreateAndVerifyProof~ steps model an ~Authority~ verifying a proof created by specified Holder,
    rather than a generic Verifier; this is because the decryption requires ~AuthoritySecretData~ for
    each attribute to be decrypted.  If there are decryption requirements for multiple Authorities,
    the step models Verifier having ~AuthoritySecretData~ for all of them.  While this is not
    particularly realistic, it is useful for testing generality.
**** Arguments
   - ~HolderLabel~
   - ~CreateVerifyExpectation~: expected outcome for attempt to create and then verify a proof
     consistent with established requirement.  Possible values are currently:
     - ~BothSucceedNoWarnings~: expects both proof creation and proof verification to succeed and
       issue no warnings.  In this case, revealed and decrypted values are checked to ensure that
       they are for exactly the requested attributes and furthermore that the values are equal to
       those signed in specified credentials.
     - ~CreateProofFails~: requires that proof creation fails
     - ~VerifyProofFails~: requires that proof creation succeeds and then verification fails
     - ~CreateOrVerifyFails~: requires that, either proof creation fails, or it succeeds but
       verification of the generated proof fails.  This expectation is sometimes useful when it is
       required that a proof is not successfully created and then verified, but it does not matter
       which step fails.  In some cases, some underlying ZKP libraries fail to generate a
       proof, while others generate a proof that does not verify successfully.  This
       ~CreateVerifyExpectation~ is useful in such cases.
**** API method(s) invoked
   - ~create_proof~
   - ~verify_proof~

*** CreateAuthority
   - Creates new Authority with associated ~AuthorityData~
**** Arguments
   - ~AuthorityLabel~: label to identify new Authority
**** API method(s) invoked
   - ~create_authority_data~

*** EncryptFor
**** Effects
  - adds to requirements for subsequent ~CreateAndVerifyProof~ steps for specified Holder,
    requiring that it encrypts (for specified Authority) specified attribute from credential
    signed by specified Issuer
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~
   - ~CredAttrIndex~:
   - ~AuthorityLabel~: label identifying ~Authority~ for whom specified attribute is to be encrypted
**** API method(s) invoked
   - none

*** Decrypt
**** Effects
  - adds to requirements for subsequent ~CreateAndVerifyProof~ steps for specified Holder,
    requiring that specified attribute from credential signed by specified Issuer is decrypted
**** Arguments
   - ~HolderLabel~
   - ~IssuerLabel~
   - ~CredAttrIndex~
   - ~AuthorityLabel~: label identifying ~Authority~ to decrypt specified attribute
**** API method(s) invoked
  - none

*** VerifyDecryption
**** Effects
  - Verifies correct decryption for each ~DecryptResponse~ generated by most recent ~CreateAndProof~
    step by specified Holder
**** Arguments
   - ~HolderLabel~
**** API method(s) invoked
  - ~verify_decryption~

<<sec:overriding>>
** Overriding tests

Sometimes we want finer control over how specific tests are treated in combination with specific
underlying ZKP libraries.  This is supported by a per-library overrides file.  Thus, we have
on overrides file for each underlying library currently used:
- [[../../tests/data/JSON/TestSequences/LicenseSubscription/LibrarySpecificOverrides/AC2C.json][../../tests/data/JSON/TestSequences/LicenseSubscription/LibrarySpecificOverrides/AC2C.json]]
- [[../../tests/data/JSON/TestSequences/LicenseSubscription/LibrarySpecificOverrides/AC2C.json][../../tests/data/JSON/TestSequences/LicenseSubscription/LibrarySpecificOverrides/DNC.json]]

Each entry in these overrides file has:
- a lookup label based on the test's =descr= field (see documentation in
  [[../../generate-tests-from-json/src/lib.rs][../../generate-tests-from-json/src/lib.rs]] for details)
- an associated =contents= field, which explains the reason for the override
- an associated =tag=, which determines whether the test is run and/or how its outcome is reflected in
  output.  Currently, possible values for the =tag= are =NotSoSlow=, =Fail= and =Skip=, as explained below

For a given test with a given underlying ZKP library, it could be that:
- ~NotSoSlow~: although the test has SLOW or SLOWSLOW in its name, we know that it is ~NotSoSlow~ with the specific
  underlying library, so we want to run it even when using, e.g., `make test-skip-slow` to skip slow
  tests.  The test is run, even if skipping tests with =SLOW= in their name (see below for examples).
- ~Fail~: the test is considered to ~Fail~, e.g., because of a known bug in the ZKP library or
  because it does not yet support the functionality being tested.  It is reported as a failure in test output.
- ~Skip~: we want to ~Skip~ the test for some reason.  Such tests are shown in test output as =ignored=, displaying
  the reason from the overrides file, and are counted as ignored in test summaries.  An example
  is that the underlying ZKP library has some known issue that causes a panic or test failure,
  but we don't want to see it reported as a failure, e.g., because the issue is understood and will
  be addressed in future work, or because the issue is not related to the main purpose of the test.
  An example of the latter is if the underlying ZKP library panics when incorrectly used,
  and the purpose of the test is only to ensure that it does not enable a prover to create a proof
  that a verifier successfully verifies.

If tests are run directly using ~cargo test~, then these tests that are overridden to =Fail= are
reported as failures.  To avoid confusion, such tests have ~_overridden_to_fail~ appended to their
names.  Furthermore, if running tests using any of:
- ~make test~,
- ~make test-skip-slow~, or
- ~make test-skip-slow-slow~
the ~Makefile~ is configured to exclude tests with ~_overridden_to_fail~ in their names, so overridden
tests are not reported as failures.

We would like to improve the override system.  In the meantime, it is documented in
[[../../generate-tests-from-json/src/lib.rs][../../generate-tests-from-json/src/lib.rs]].

