src/vcp/README.md


<a id="org82e34ea"></a>

## Test framework files

Located in [../../tests/vcp/](../../tests/vcp/):

    data_for_tests.rs
    test_framework
        steps.rs                                : The main file of the testing framework.
                                                  Defines the TestSteps.
        tests
            framework_tests.rs                  : Rust code that tests the framework itself
    
        types.rs                                : types used by the test framework, in particular TestState
    
        utility_functions.rs                    : useful routines to compose common operations
        utils.rs
    
    zkp_backends
        ac2c
            run_json_test_framework_tests.rs    : Test the framework itself
                                                  with CryptoInterface instantiated with AC2C
                                                  using JSON tests located in
                                                  ./tests/data/JSON/TestSequences/TestingFramework
    
            run_json_zkp_functionality_tests.rs : Instantiates CryptoInterface with AC2C and runs the JSON tests located in
                                                  ./tests/data/JSON/TestSequences/LicenseSubscription
                                                  with overrides defined in
                                                 ./tests/data/JSON/TestSequences/LicenseSubscription/LibrarySpecificOverrides/AC2C.json
    
            run_zkp_functionality_tests.rs      : Instantiates CryptoInterface with AC2C and runs the tests
                                                  defined in zkp_functionality_tests/test_definitions.rs
        dnc
            run_json_test_framework_tests.rs    : Test the framework itself
                                                  with CryptoInterface instantiated with DNC
                                                  using JSON tests located in
                                                  ./tests/data/JSON/TestSequences/TestingFramework
    
            run_json_zkp_functionality_tests.rs : Instantiates CryptoInterface with DNC and runs the JSON tests located in
                                                  ./tests/data/JSON/TestSequences/LicenseSubscription
                                                  with overrides defined in
                                                 ./tests/data/JSON/TestSequences/LicenseSubscription/LibrarySpecificOverrides/DNC.json
    
    zkp_functionality_tests
        test_definitions.rs                     : ZKP functionality tests written in Rust (rather than JSON).

Note: the other tests located in [tests/vcp](../../tests/vcp) (various unit tests) can be ignored.


<a id="org3a2ac70"></a>

# The VCP architecture

The following diagram gives a high-level view of the VCP architecture.
It is shown using AC2C.  For DNC, the GENERAL part is identical but the DNC SPECIFIC part
has different paths (but essentially does the same work, additionally providing
\`specific_verify_decryption\`, which is not yet supported by AC2C).

                             SigsAnd         Credential       Shared    DataForVerifier DecryptReqs
                           RelatedData          Reqs  -->+<-- Params              |      |
                                |                        |                        |      |
                                |   +--------------------+--------------------+   |      |
                                v   v                                         v   v      v
                              create_proof                                    verify_proof          ----+
                                |   |                                         |   |      |              |
                                |   +-----> presentation_request_setup <------+   |      |              | GENERAL
                                |                        |                        |      |              |
                                |                        v                        |      |              |
                                |           resolved_proof_instructions           |      |              |
                                |                       and                       |      |              |
                                |              equality_requirements              |      |              |
                                |                        |                        |      |          ----+
                                |           +------------+----------+             |      |
                                v           v                       v             v      v
                         specific_prover_ac2c                       specific_verifier_ac2c          ----+
                                |           |                       |             |      |              |
                                |           +------------+----------+             |      |              |
                                v                        |                        |      |              |
    presentation_credentials_from                        |                        |      |              | SPECIFIC
                                |                        v                        |      x              |
                                +----------> presentation_schema_from <-----------+      x              |
                                |                                                 |      x              |
                                v                                                 v      x              |
                      Presentation::create                              Presentation::verify        ----+
                                |                                                 |
                                v                                                 v
                        DataForVerifier                                    DecryptResponse(s)

VCP is comprised of three main parts

-   API (defined by the `PlatformAPI` type in [./api.rs](./api.rs))
    -   functions available for various roles (e.g., Issuer, Holder, Verifier, &#x2026;)
-   general
    -   implementations of API functions that operate regardless of the underlying ZKP library
-   specific
    -   functions called from general that implement "primitive" features (e.g., sign, prove,
        verify) for a specific underlying ZKP library


<a id="org4a08daf"></a>

## General

A proof is created from

-   `SignatureAndRelatedData` : signature from an Issuer on a list of `DataValue`

-   `CredentialReqs` : the requirements for each credential
    (e.g., values in range, what values should be revealed, &#x2026;)
-   Shared Params : the values referenced from `CredentialReqs`

A proof is verified from

-   `CredentialReqs` and shared params
-   `DataForVerifier` : includes disclosed values and a proof (created by `create_proof`)
-   `DecryptReqs` : verifiable decryption requests

Both the general `create_proof` and `verify_proof` call `presentation_request_setup`.
That function transforms shared parameters and human-friendly `CredentialReqs` into machine-friendly
`resolved_proof_instructions` and `equality_requirements`.

Both the general `create_proof` and `verify_proof` then pass that info to "specific" versions of
create and verify.  The AC2C versions are shown in the above diagram.
