src/vcp/README.org
** Specific

=specific_prover_ac2c= turns =SignatureAndRelatedData= into =anoncreds-v2-rs= "credentials"
(via =presentation_credentials_from=).

Both =specific_prover_ac2c= and =specific_verifier_ac2c= call =presentation_schema_from=
with =resolved_proof_instructions= and =equality_requirements= to create an
=anoncreds-v2-rs= presentation schema.

=specific_prover_ac2c= uses the =anoncreds-v2-rs= credentials and presentation schema to create a proof.
That proof is then converted to an opaque =Proof= and included in the =DataForVerifier= API type,
along with disclosed values.

=specific_verifier_ac2c= uses the =DataForVerifier= and the =anoncreds-v2-rs= presentation schema
to verify the proof.

# ------------------------------------------------------------------------------
* Guide to =src/vcp= code

** Directory structure

VCP code resides in the [[../../src/vcp/][../../src/vcp/]] directory.

The top level directory contains:

#+begin_example
api.rs                                    : the main top-level PlatformApi

api_utils.rs                              : connects a specific CryptoInterface to the PlatformApi
#+end_example

The directory structure for the interfaces used by =PlatformApi= is:

#+begin_example
interfaces
    crypto_interface.rs               : function types that a specific ZKP library must implement

    non_primitives.rs                 : function types for functions provided by VCP
    primitives
        types.rs                      : data declarations for data used by CryptoInterface functions

    primitives.rs                     : function types for the functions in CryptoInterface

    types.rs                          : data declarations for data used in PlatformApi and CryptoInterface
#+end_example

The directory structure for the "general" implementation is:

#+begin_example
impl
    catch_unwind_util.rs
    general
        presentation_request_setup.rs : translates proof requests to proof instructions and equality requirements

        proof.rs                      : general create_proof, verify_proof and verify_decryption functions
                                        that call specific ZKP library implementations of primitives
    json
        shared_params.rs              : utilities for working with shared parameters
        util.rs
    to_from_api.rs                    : definitions of functions to convert between API types and
                                        specific ZKP library implementation types

    types.rs                          : data declarations available for any specific implementation to use
    util.rs
#+end_example

The directory structure for the AC2C implementation of =CryptoInterface= is:

#+begin_example
zkp_backends
    ac2c
        accumulators.rs               : AC2C VB implementation of CryptoInterface accumulator primitives

        authority.rs                  : AC2C implementation of CryptoInterface authority primitives

        crypto_interface_ac2c.rs      : Provides the AC2C implementation of CryptoInterface

        presentation_request_setup.rs : Functions in this file are used by the following proof.rs file.
                                        Generate AC2C proof statements and equality statements
                                        from proof instructions (derived from proof requirements).
                                        Also, generate AC2C PresentationCredentials from signatures and witnesses

        proof.rs                      : AC2C implementations of specific_create_proof,
                                        specific_verify_proof functions (and in future, specific_verify_decryption,
                                        when AC2C supports it)

        range_proof.rs                : AC2C implementation of range proof operations

        signer.rs                     : AC2C implementations of "signer" (a.k.a Issuer)
                                        primitive functions (e.g., create keys, sign)

        to_from_api/*                 : functions to convert between API data types and AC2C data types
#+end_example

The directory structure for the DNC implementation of =CryptoInterface= is:

#+begin_example
zkp_backends
    dnc
        accumulators.rs               : DNC VB implementation of CryptoInterface accumulator primitives

        authority.rs                  : DNC implementation of CryptoInterface authority primitives

        crypto_interface_dnc.rs       : Provides the AC2C implementation of CryptoInterface

        generate_frs.rs               : Turns user values to be signed into "FR"s (i.e., field elements)

        in_memory_state.rs            : A non-production-ready "database" to hold state
                                        associated with an accumulator

        proof.rs                      : DNC implementations of specific_create_proof,
                                        specific_verify_proof and specific_verify_decryption functions

        range_proof.rs                : DNC implementation of range proof operations

        reversible_encoding.rs        : Used for verifiable encryption

        signer.rs                     : DNC implementations of "signer" (a.k.a Issuer)
                                        primitive functions (e.g., create keys, sign)

        to_from_api/*                 : functions to convert between API data types and DNC data types

        types.rs                      : Type aliases used in the DNC implementation
#+end_example

<<connecting-zkp-libary-to-platform>>
** Example of connecting a specific ZKP library to =PlatformApi=

In [[./zkp_backends/ac2c/crypto_interface.rs][./zkp_backends/ac2c/crypto_interface.rs]] the AC2C implementation initializes a =CryptoInterface=
([[./interfaces/crypto_interface.rs][./interfaces/crypto_interface.rs]]) struct with "pointers" to the AC2C implementation of
[[./interfaces/primitives.rs][./interfaces/primitives.rs]]. That initialized struct is referenced as =CRYPTO_INTERFACE_AC2C=.

=CRYPTO_INTERFACE_AC2C= is passed to =implement_platform_api_using= (defined in [[./api_utils.rs][./api_utils.rs]])
to create an instance of =PlatformApi=.  Many of the primitives are directly assigned to =PlatformApi= fields.

The =specific_prover=, =specific_verifier=, =specific_verify_decryption= values are first passed to
the non-primitive, =create_proof=, =verify_proof=, and =verify_decryption= functions to create a higher-level
=PlatformAPI= function, which are then assigned to their associated fields.

An example of making this connection can be seen in the =run_json_test_ac2c= function in
[[../../tests/vcp/zkp_functionality_tests/test_definitions.rs][../../tests/vcp/zkp_functionality_tests/test_definitions.rs]].

# --------------------------------------------------
