src/vcp/README.md


<a id="orgeede47c"></a>

## Creating an Issuer's public and secret data (e.g., keys)

To prepare for signing credentials, an Issuer uses `create_signer_data` in `PlatformApi` ([./api.rs](./api.rs)).

The type of that function, `CreateSignerData`, is defined in [./interfaces/primitives.rs](./interfaces/primitives.rs).

It takes

-   a `Natural` (an RNG seed), and
-   a list of `ClaimType` (both defined in [./interfaces/types.rs](./interfaces/types.rs))
    -   this is the "schema" for credentials that will be issued and signed by the Issuer

Assuming the AC2C implementation of primitives are connected to `PlatformApi`,
as described in <a id="orgb6020b6"></a>,
then `create_signer_data` (in [./zkp_backends/ac2c/signer.rs](./zkp_backends/ac2c/signer.rs)) is invoked.

The `create_signer_data` implementation

-   creates an AC2C schema representation based on a list of VCP `ClaimType`
-   creates AC2C public and secret data (that includes public/secret keys)
-   returns VCP `SignerData`

`SignerData` ([./interfaces/types.rs](./interfaces/types.rs)) contains

-   `SignerSecretData`
    -   an opaque representation of the AC2C secret data
-   `SignerPublicData`
    -   an opaque representation of the AC2C public data
    -   a vector of `ClaimType` (i.e., the "schema")

An Issuer would securely store the private data and make the public data available.


<a id="org8e5d63a"></a>

## Issuer signing a credential

To sign credentials, an Issuer uses the `PlatformApi` ([./api.rs](./api.rs)) `sign` function
of type `Sign` ([./interfaces/primitives.rs](./interfaces/primitives.rs)).

It takes

-   a `Natural` (an RNG seed)
-   a list of `DataValue` ([./interfaces/types.rs](./interfaces/types.rs))
-   `SignerData` (from `create_signer_data` above)

The AC2C implementation of `sign` is in [./zkp_backends/ac2c/signer.rs](./zkp_backends/ac2c/signer.rs).

That `sign` implementation

-   converts each VCP `DataValue` to an AC2C claim
-   uses AC2C to sign the claims using the secret data from `SignerData`
-   returns a `Signature` (an opaque representation of an AC2C signature)


<a id="org91f8034"></a>

## Creating a proof

The general `create_proof` function ([./impl/general/proof.rs](./impl/general/proof.rs)) takes

-   proof requirements : `HashMap<CredentialLabel, CredentialReqs>`
    -   `CredentialLabel`
        -   an identifier used to refer to a credential for which a Prover must
            prove knowledge of a signature satisfying the associated `CredentialReqs`, as well as
            for establishing equalities between attributes
            in different credentials
    -   `CredentialReqs` ([./interfaces/types.rs](./interfaces/types.rs))
        -   what is required to be proved (e.g., reveal values, accumulator membership, &#x2026;)
-   shared parameters : `HashMap<SharedParamKey, SharedParamValue>`
    -   `SharedParamKey`
        -   an identifier used in `CredentialReqs` (above) to specify a value contained in shared parameters
    -   `SharedParamValue`
        -   a value, e.g., range min/max, Issuer public data
-   signatures, etc : `HashMap<CredentialLabel, SignatureAndRelatedData>`
    -   provides `SignatureAndRelatedData` for each credential referenced in proof requirements
    -   `SignatureAndRelatedData` contains
        -   `Signature`
            -   used to create a proof-of-knowledge
        -   list of `DataValue`
            -   the values that we used to create the signature
        -   `AccumulatorWitnesses`
            -   set membership witnesses for any accumulators in the requirements (could be none)
        -   `Option<Nonce>`
            -   An optional `Nonce` agreed between Prover and Verifier to avoid replay attacks

Using the above input, the general `create_proof` function

-   gets the values to reveal from the list of `DataValue`
-   transforms human-friendly `CredentialReqs` into machine-friendly "proof instructions" and equality requirements
    -   via `presentation_request_setup` ([./impl/general/presentation_request_setup.rs](./impl/general/presentation_request_setup.rs))
    -   the "proof instructions" returned by `presentation_request_setup` are of type `ProofInstructionGeneral<ResolvedDisclosure>`
    -   `ProofInstructionGeneral` identifies the credential and attribute for which a proof is required, and also the index of a "related" proof instruction, namely the proof instruction for the proof of knowledge of signature covering the relevant attribute
    -   There is one `ResolvedDisclosure` constructor for each type of proof supported:
        -   `CredentialResolved` (requires proof of knowledge of signature on a credential)
        -   `InAccumResolved`
        -   `InRangeResolved`
        -   `EncryptedForResolved`
    -   Each `ResolvedDisclosure` contains the parameters for the relevant proof, looked up from `SharedParams` using the `SharedParamKey` s included in `CredentialReqs`.  These parameters are in library-independent format.  Each ZKP backend knows how to translate these to their own data types and use them to construct the required proofs.
-   validates the `CredentialReqs` against schemas
-   calls the specific ZKP library function `specific_prover`, passing the proof instructions, equality requirements, signatures, etc.
    -   Each ZKP backend we have implemented specifies its own library-specific type of "proof instruction"; we call them `ProofInstructionGeneral<SupportedDisclosure>` in both cases, but this is not a requirement.

The AC2C `specific_prover` (named `specific_prover_ac2c` in [./zkp_backends/ac2c/proof.rs](./zkp_backends/ac2c/proof.rs)).

-   creates an AC2C `Presentation` (i.e., "proof") ([../presentation.rs](../presentation.rs))
-   wraps that proof in a VCP opaque data type
-   returns `DataForVerifier` that contains the VCP proof and any warnings


<a id="org47b9094"></a>

## Verifying a proof

Like the general `create_proof` function,
the general `verify_proof` function ([./impl/general/proof.rs](./impl/general/proof.rs)) takes

-   proof requirements : `HashMap<CredentialLabel, CredentialReqs>`
-   shared parameters : `HashMap<SharedParamKey, SharedParamValue>`
-   `Option<Nonce>`

It also takes:

-   data for verifier : `DataForVerifier` (produced by `create_proof)`.
-   decryption requests: `HashMap<String, HashMap<u64, HashMap<String, DecryptRequest>>>`

Note that AC2C does not yet support decryption, so if the decryption requests map is
not empty, verification fails.

After transforming `CredentialReqs` into proof instructions and equality requirements and
after validating those requirements against schemas it calls the `specific_verifier` function.

The AC2C `specific_verifier` (named `specific_verifier_ac2c` in [./zkp_backends/ac2c/proof.rs](./zkp_backends/ac2c/proof.rs))
converts the VCP information and data into formats used by AC2C, and then calls
the AC2C `Presentation:verify` to verify the proof.
