src/vcp/README.md


<a id="orgd379f23"></a>

## Proofs with revealed values

Attributes whose values are to be revealed are specified in the `disclosed: Disclosed` field of `CredentialReqs`.

`Disclosed` ([./interfaces/types.rs](./interfaces/types.rs)) is a list of indices into the list of `DataValue` that were signed,
specifying which values should be disclosed.

Both the general `create_proof` and `verify_proof` functions ([./impl/general/proof.rs](./impl/general/proof.rs)) call
`presentation_request_setup` ([./impl/general/presentation_request_setup.rs](./impl/general/presentation_request_setup.rs)) that calls
`get_proof_instructions` to transform `CredentialReqs` into proof instructions.
For each credential request, the translation happens in `get_proof_instructions_for_cred`.

For revealed values, the `ProofInstructionGeneral` that gets returned is
`ResolvedDisclosure::CredentialResolvedWrapper(CredentialResolved`.  It contains

-   `SignerPublicData`
-   for each reveal value: a list of tuples : `(index, value, ClaimType)`

Both the general `create_proof` and `verify_proof` functions go on to call their specific variants,
in the AC2C case, `specific_prover_ac2c` and `specific_verifier_ac2c` ([./zkp_backends/ac2c/proof.rs](./zkp_backends/ac2c/proof.rs)).

The specific functions call `presentation_schema_from` which calls
`transform_instruction` ([./zkp_backends/ac2c/presentation_request_setup.rs](./zkp_backends/ac2c/presentation_request_setup.rs)) to
transform the `ProofInstructionGeneral<ResolvedDisclosure>` into a
`ProofInstructionGeneral<SupportedDisclosure>`.
That function returns a proof instruction that contains `SupportedDisclosure::SignatureAndReveal` that contains

-   an `anoncreds-v2-rs` `IssuerPublic`
-   `HashMap<CredAttrIndex, (DataValue, ClaimType)>`

`SupportedDisclosure` is then given to `generate_statements` ([./zkp_backends/ac2c/presentation_request_setup.rs](./zkp_backends/ac2c/presentation_request_setup.rs)).
For `SupportedDisclosure::SignatureAndReveal`, `generate_statements` creates an `anoncreds-v2-rs`
`SignatureStatement` containing

-   the disclosed information
-   a statement ID
-   `anoncreds-v2-rs` `IssuerPublic`

The `anoncreds-v2-rs` statements returned from `generate_statements` are given to
`anoncreds-v2-rs` `PresentationSchema::new_with_id`, which is then returned from
`presentation_schema_from`.

At this point `specific_prover_ac2c` calls `anoncreds-v2-rs` `Presentation::create` with

-   the `PresentationSchema`
-   `anoncreds-v2-rs` `IndexMap<CredentialLabel, PresentationCredential>`
    -   created by a call to `presentation_credentials_from` ([./zkp_backends/ac2c/proof.rs](./zkp_backends/ac2c/proof.rs))

That `anoncreds-v2-rs` `Presentation` (i.e., proof) is returned from `specific_prover_ac2c`.

In the `specific_verifier_ac2c` case, it calls `anoncreds-v2-rs` `Presentation::verify` with
the `PresentationSchema` to verify the proof.


<a id="org0c5f4ac"></a>

## Proofs with range proofs

Range proofs are requirements in the `in_range: InRange` field of `CredentialReqs`.

`InRange` ([./interfaces/types.rs](./interfaces/types.rs)) is a list of `InRangeInfo` that contain

-   an index specifying which value in the list of `DataValue` to be used
-   a `min_label` : a key into shared parameters; that key maps to the actual minimum value
-   a `max_label` : a key into shared parameters; that key maps to the actual maximum value
-   `proving_key_label` : a key into shared parameters; that key maps to an instance of  `RangeProofProvingKey`

For range proofs,
`ResolvedDisclosure::InRangeResolvedWrapper(InRangeResolved` is created. It contains

-   `min_val`     : looked up from shared parameters
-   `max_val`     : looked up from shared parameters
-   `proving_key` : looked up from shared parameters
-   (the index is also collected into the outer `ProofInstructionGeneral`)

The AC2C implementation then transforms that `ResolvedDisclosure` into
`SupportedDisclosure::RangeProof` that contains

-   the `anoncreds-v2-rs` range proving key
-   the min and max values
-   the index

`SupportedDisclosure::RangeProof`  is given to `generate_statements`
which creates two `anoncreds-v2-rs` statements:

-   `CommitmentStatement`
-   `RangeStatement`

Those statements are then used to create and verify proofs


<a id="org6fb487c"></a>

## Proofs with verifiable encryption

Verifiable encryption requirements are specified in the `encrypted_for: EncryptedFor` field of `CredentialReqs`.

`EncryptedFor` ([./interfaces/types.rs](./interfaces/types.rs)) is a list of `IndexAndLabel` that contain

-   an index specifying which value in the list of `DataValue` to be encrypted
-   a `label` : a key into shared parameters; that key maps to the public data that should be used for encryption.

For verifiable encryption,
`ResolvedDisclosure::EncryptedForResolvedWrapper(EncryptedForResolved)` is created. It contains

-   the API public data to be used for encryption

The AC2C implementation then transforms that `ResolvedDisclosure` into
`SupportedDisclosure::EncryptedFor` that contains

-   the `anoncreds-v2-rs` verifiable encryption public key

`SupportedDisclosure::EncryptedFor`  is given to `generate_statements`
which creates a `anoncreds-v2-rs` `VerifiableEncryptionStatement`

NOTE: AC2C does not yet support decryption.


<a id="orga7e495f"></a>

## Proofs with equalities between attributes

Equality requirements are specified in the `equal_to: EqualTo` field of `CredentialReqs`.

`EqualTo` ([./interfaces/types.rs](./interfaces/types.rs)) is a list of `EqInfo` that contain

-   `from_index` : an index specifying which value in the list of `DataValue` to be used in equality checking
-   `to_label`   : a label specifying a `CredentialReqs`
-   `to_index`   : index into the `DataValue` of the `to_label` credential to be used in equality checking

General `presentation_request_setup` calls `equality_reqs_from_pres_reqs_general` to create

-   `EqualityReqs = Vec<EqualityReq>`
-   `EqualityReq  = Vec<(CredentialLabel, CredAttrIndex)>`

where each `EqualityReq` is a list of pairs that point to values that should be equal.

`EqualityReqs` is given to `specific_prover`.  In the AC2C case, `specific_prover_ac2c` calls
`presentation_schema_from` ([./impl/zkp_backends/ac2c/presentation_request_setup.rs](./impl/zkp_backends/ac2c/presentation_request_setup.rs)) with those `EqualityReqs`.
`presentation_schema_from` pass those to `generate_equality_statements` to create a `anoncreds-v2-rs`
`EqualityStatement` for each equality.


<a id="org1f53a37"></a>

## Proofs with accumulators

Accumulator requirements are specified in the `in_accum: InAccum` field of `CredentialReqs`.

`InAccum` ([./interfaces/types.rs](./interfaces/types.rs)) is a list of `InAccumInfo` that contain

-   an index specifying which value in the list of `DataValue` represents an accumlator element
-   `public_data_label` : a key into shared parameters; that key maps to `AccumulatorPublicData`
-   `mem_prv_label`     : a key into shared parameters; that key maps to a `MembershipProvingKey`
-   `accumulator_label` : a key into shared parameters; that key maps to an `Accumulator`
-   `accumulator_seq_no_label` : a key into shared parameters; that key maps to the sequence number of the accumulator

For accumulators
`ResolvedDisclosure::InAccumResolvedWrapper(InAccumResolved` is created. It contains

-   the API values obtained from the keys in `InAccum`

The AC2C implementation then transforms that `ResolvedDisclosure` into
`SupportedDisclosure::InAccumProof` that contains

-   the `anoncreds-v2-rs` `vb20::PublicKey` for accumulators
-   the `anoncreds-v2-rs` `vb20::Accumulator` accumulator

`SupportedDisclosure::InAccumProof` is given to `generate_statements`
which creates a `anoncreds-v2-rs` `MembershipStatement`
