src/vcp/README.md


<a id="org8c7cbc6"></a>

## Accumulator functions

There are functions for ([./api.rs](./api.rs), [./interfaces/primitives.rs](./interfaces/primitives.rs))

-   creating accumulators (and their associated keys)
-   creating accumulator elements from `DataValue`
-   adding and removing elements from accumulators and getting witnesses for those elements
-   updating existing witnesses after elements have been added to or removed from an accumulator

The AC2C versions are in [./zkp_backends/ac2c/accumulators.rs](./zkp_backends/ac2c/accumulators.rs).

